app/views/orders/_form.html.erb

    <%= f.label :user_id %>
    <%= f.select :user_id,
        options_for_select( @users.map { |u| [u.fullname,u.id] }, order.user.try(:id) ), include_blank: true
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

     <ul>
       <% order.items.each do |item| %>
---
SELECT "items".id FROM "items" INNER JOIN "items_orders" ON "items"."id" = "items_orders"."item_id" WHERE "items_orders"."order_id" = ?  [["order_id", 1]]

     <ul>
       <% order.labels.each do |label| %>
---
SELECT "labels".* FROM "labels" INNER JOIN "labels_orders" ON "labels"."id" = "labels_orders"."label_id" WHERE "labels_orders"."order_id" = $1  [["order_id", 1]]