app/views/orders/index.html.erb

SELECT "items".* FROM "items" INNER JOIN "items_orders" ON "items"."id" = "items_orders"."item_id" WHERE "items_orders"."order_id" = ?  [["order_id", 1]]
---
        <td>
          <% order.items.each do |i| %>

SELECT "labels".* FROM "labels" INNER JOIN "labels_orders" ON "labels"."id" = "labels_orders"."label_id" WHERE "labels_orders"."order_id" = ?  [["order_id", 1]]
---
        <td>
          <% order.labels.each do |i| %>