app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE (created_at >= '2016-07-28 00:00:00') LIMIT $1  [["LIMIT", 1]]
---
  def index

    if session[:filter_date].present?
      @orders = Order.all.by_date(session[:filter_date]).limit(1)

SELECT "items".* FROM "items"
SELECT "users".* FROM "users"
---
  def new
    @order = Order.new
    @items = Item.all
    @users = User.all

SELECT "items".* FROM "items"
SELECT "users".* FROM "users"
SELECT "labels".* FROM "labels"
---
  def edit
    @items = Item.all
    @users = User.all
    @labels = Label.all

INSERT INTO "items_orders" ("order_id", "item_id") VALUES (?, ?)  [["order_id", 6], ["item_id", 1]]
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", 2016-07-28 04:25:48 UTC], ["updated_at", 2016-07-28 04:25:48 UTC]]
---
  def create
    @order = Order.new(order_user_params)

    respond_to do |format|
      if @order.save && order_update_items && order_update_labels

UPDATE "orders" SET "user_id" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["user_id", 2], ["updated_at", 2016-07-26 03:47:40 UTC], ["id", 3]]
---
  def update
    respond_to do |format|
      if @order.update(order_user_params) && order_update_items && order_update_labels